renfernand/OWSNRIT/openwsn/bsp/boards/cc2538em/inc/hw_rfcore_xreg.h
/******************************************************************************
*  Filename:       hw_rfcore_xreg.h
*  Revised:        $Date: 2013-04-30 17:13:44 +0200 (Tue, 30 Apr 2013) $
*  Revision:       $Revision: 9943 $
*
*  Copyright (C) 2013 Texas Instruments Incorporated - http://www.ti.com/
*
*
*  Redistribution and use in source and binary forms, with or without
*  modification, are permitted provided that the following conditions
*  are met:
*
*    Redistributions of source code must retain the above copyright
*    notice, this list of conditions and the following disclaimer.
*
*    Redistributions in binary form must reproduce the above copyright
*    notice, this list of conditions and the following disclaimer in the
*    documentation and/or other materials provided with the distribution.
*
*    Neither the name of Texas Instruments Incorporated nor the names of
*    its contributors may be used to endorse or promote products derived
*    from this software without specific prior written permission.
*
*  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
*  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
*  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
*  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
*  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
*  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
*  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
*  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
*  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
*  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
*  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*
******************************************************************************/

#ifndef __HW_RFCORE_XREG_H__
#define __HW_RFCORE_XREG_H__

//*****************************************************************************
//
// The following are defines for the RFCORE_XREG register offsets.
//
//*****************************************************************************
#define RFCORE_XREG_FRMFILT0    0x40088600  // The frame filtering function 
                                            // rejects unintended frames as 
                                            // specified by IEEE 802.15.4, 
                                            // section 7.5.6.2, third filtering 
                                            // level. In addition, it provides 
                                            // filtering on: - The eight 
                                            // different frame types (see the 
                                            // FRMFILT1 register) - The 
                                            // reserved bits in the frame 
                                            // control field (FCF) The function 
                                            // is controlled by: - The FRMFILT0 
                                            // and FRMFILT1 registers - The 
                                            // PAN_ID, SHORT_ADDR, and EXT_ADDR 
                                            // values in RAM 
#define RFCORE_XREG_FRMFILT1    0x40088604  // The frame filtering function 
                                            // rejects unintended frames as 
                                            // specified by IEEE 802.15.4, 
                                            // section 7.5.6.2, third filtering 
                                            // level. In addition, it provides 
                                            // filtering on: - The eight 
                                            // different frame types (see the 
                                            // FRMFILT1 register) - The 
                                            // reserved bits in the frame 
                                            // control field (FCF) The function 
                                            // is controlled by: - The FRMFILT0 
                                            // and FRMFILT1 registers - The 
                                            // PAN_ID, SHORT_ADDR, and EXT_ADDR 
                                            // values in RAM 
#define RFCORE_XREG_SRCMATCH    0x40088608  // Source address matching and 
                                            // pending bits 
#define RFCORE_XREG_SRCSHORTEN0 \
                                0x4008860C  // Short address matching 

#define RFCORE_XREG_SRCSHORTEN1 \
                                0x40088610  // Short address matching 

#define RFCORE_XREG_SRCSHORTEN2 \
                                0x40088614  // Short address matching 

#define RFCORE_XREG_SRCEXTEN0   0x40088618  // Extended address matching 
#define RFCORE_XREG_SRCEXTEN1   0x4008861C  // Extended address matching 
#define RFCORE_XREG_SRCEXTEN2   0x40088620  // Extended address matching 
#define RFCORE_XREG_FRMCTRL0    0x40088624  // Frame handling 
#define RFCORE_XREG_FRMCTRL1    0x40088628  // Frame handling 
#define RFCORE_XREG_RXENABLE    0x4008862C  // RX enabling 
#define RFCORE_XREG_RXMASKSET   0x40088630  // RX enabling 
#define RFCORE_XREG_RXMASKCLR   0x40088634  // RX disabling 
#define RFCORE_XREG_FREQTUNE    0x40088638  // Crystal oscillator frequency 
                                            // tuning 
#define RFCORE_XREG_FREQCTRL    0x4008863C  // Controls the RF frequency 
#define RFCORE_XREG_TXPOWER     0x40088640  // Controls the output power 
#define RFCORE_XREG_TXCTRL      0x40088644  // Controls the TX settings 
#define RFCORE_XREG_FSMSTAT0    0x40088648  // Radio status register 
#define RFCORE_XREG_FSMSTAT1    0x4008864C  // Radio status register 
#define RFCORE_XREG_FIFOPCTRL   0x40088650  // FIFOP threshold 
#define RFCORE_XREG_FSMCTRL     0x40088654  // FSM options 
#define RFCORE_XREG_CCACTRL0    0x40088658  // CCA threshold 
#define RFCORE_XREG_CCACTRL1    0x4008865C  // Other CCA Options 
#define RFCORE_XREG_RSSI        0x40088660  // RSSI status register 
#define RFCORE_XREG_RSSISTAT    0x40088664  // RSSI valid status register 
#define RFCORE_XREG_RXFIRST     0x40088668  // First byte in RX FIFO 
#define RFCORE_XREG_RXFIFOCNT   0x4008866C  // Number of bytes in RX FIFO 
#define RFCORE_XREG_TXFIFOCNT   0x40088670  // Number of bytes in TX FIFO 
#define RFCORE_XREG_RXFIRST_PTR \
                                0x40088674  // RX FIFO pointer 

#define RFCORE_XREG_RXLAST_PTR \
                                0x40088678  // RX FIFO pointer 

#define RFCORE_XREG_RXP1_PTR    0x4008867C  // RX FIFO pointer 
#define RFCORE_XREG_TXFIRST_PTR \
                                0x40088684  // TX FIFO pointer 

#define RFCORE_XREG_TXLAST_PTR \
                                0x40088688  // TX FIFO pointer 

#define RFCORE_XREG_RFIRQM0     0x4008868C  // RF interrupt masks 
#define RFCORE_XREG_RFIRQM1     0x40088690  // RF interrupt masks 
#define RFCORE_XREG_RFERRM      0x40088694  // RF error interrupt mask 
#define RFCORE_XREG_RFRND       0x4008869C  // Random data 
#define RFCORE_XREG_MDMCTRL0    0x400886A0  // Controls modem 
#define RFCORE_XREG_MDMCTRL1    0x400886A4  // Controls modem 
#define RFCORE_XREG_FREQEST     0x400886A8  // Estimated RF frequency offset 
#define RFCORE_XREG_RXCTRL      0x400886AC  // Tune receive section 
#define RFCORE_XREG_FSCTRL      0x400886B0  // Tune frequency synthesizer 
#define RFCORE_XREG_FSCAL0      0x400886B4  // Tune frequency calibration 
#define RFCORE_XREG_FSCAL1      0x400886B8  // Tune frequency calibration 
#define RFCORE_XREG_FSCAL2      0x400886BC  // Tune frequency calibration 
#define RFCORE_XREG_FSCAL3      0x400886C0  // Tune frequency calibration 
#define RFCORE_XREG_AGCCTRL0    0x400886C4  // AGC dynamic range control 
#define RFCORE_XREG_AGCCTRL1    0x400886C8  // AGC reference level 
#define RFCORE_XREG_AGCCTRL2    0x400886CC  // AGC gain override 
#define RFCORE_XREG_AGCCTRL3    0x400886D0  // AGC control 
#define RFCORE_XREG_ADCTEST0    0x400886D4  // ADC tuning 
#define RFCORE_XREG_ADCTEST1    0x400886D8  // ADC tuning 
#define RFCORE_XREG_ADCTEST2    0x400886DC  // ADC tuning 
#define RFCORE_XREG_MDMTEST0    0x400886E0  // Test register for modem 
#define RFCORE_XREG_MDMTEST1    0x400886E4  // Test Register for Modem 
#define RFCORE_XREG_DACTEST0    0x400886E8  // DAC override value 
#define RFCORE_XREG_DACTEST1    0x400886EC  // DAC override value 
#define RFCORE_XREG_DACTEST2    0x400886F0  // DAC test setting 
#define RFCORE_XREG_ATEST       0x400886F4  // Analog test control 
#define RFCORE_XREG_PTEST0      0x400886F8  // Override power-down register 
#define RFCORE_XREG_PTEST1      0x400886FC  // Override power-down register 
#define RFCORE_XREG_CSPPROG0    0x40088700  // CSP program 
#define RFCORE_XREG_CSPPROG1    0x40088704  // CSP program 
#define RFCORE_XREG_CSPPROG2    0x40088708  // CSP program 
#define RFCORE_XREG_CSPPROG3    0x4008870C  // CSP program 
#define RFCORE_XREG_CSPPROG4    0x40088710  // CSP program 
#define RFCORE_XREG_CSPPROG5    0x40088714  // CSP program 
#define RFCORE_XREG_CSPPROG6    0x40088718  // CSP program 
#define RFCORE_XREG_CSPPROG7    0x4008871C  // CSP program 
#define RFCORE_XREG_CSPPROG8    0x40088720  // CSP program 
#define RFCORE_XREG_CSPPROG9    0x40088724  // CSP program 
#define RFCORE_XREG_CSPPROG10   0x40088728  // CSP program 
#define RFCORE_XREG_CSPPROG11   0x4008872C  // CSP program 
#define RFCORE_XREG_CSPPROG12   0x40088730  // CSP program 
#define RFCORE_XREG_CSPPROG13   0x40088734  // CSP program 
#define RFCORE_XREG_CSPPROG14   0x40088738  // CSP program 
#define RFCORE_XREG_CSPPROG15   0x4008873C  // CSP program 
#define RFCORE_XREG_CSPPROG16   0x40088740  // CSP program 
#define RFCORE_XREG_CSPPROG17   0x40088744  // CSP program 
#define RFCORE_XREG_CSPPROG18   0x40088748  // CSP program 
#define RFCORE_XREG_CSPPROG19   0x4008874C  // CSP program 
#define RFCORE_XREG_CSPPROG20   0x40088750  // CSP program 
#define RFCORE_XREG_CSPPROG21   0x40088754  // CSP program 
#define RFCORE_XREG_CSPPROG22   0x40088758  // CSP program 
#define RFCORE_XREG_CSPPROG23   0x4008875C  // CSP program 
#define RFCORE_XREG_CSPCTRL     0x40088780  // CSP control bit 
#define RFCORE_XREG_CSPSTAT     0x40088784  // CSP status register 
#define RFCORE_XREG_CSPX        0x40088788  // CSP X data register 
#define RFCORE_XREG_CSPY        0x4008878C  // CSP Y data register 
#define RFCORE_XREG_CSPZ        0x40088790  // CSP Z data register 
#define RFCORE_XREG_CSPT        0x40088794  // CSP T data register 
#define RFCORE_XREG_RFC_OBS_CTRL0 \
                                0x400887AC  // RF observation mux control 

#define RFCORE_XREG_RFC_OBS_CTRL1 \
                                0x400887B0  // RF observation mux control 

#define RFCORE_XREG_RFC_OBS_CTRL2 \
                                0x400887B4  // RF observation mux control 

#define RFCORE_XREG_TXFILTCFG   0x400887E8  // TX filter configuration 


//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_FRMFILT0 register.
//
//*****************************************************************************
#define RFCORE_XREG_FRMFILT0_MAX_FRAME_VERSION_M \
                                0x0000000C  // Used for filtering on the frame 
                                            // version field of the frame 
                                            // control field (FCF) If 
                                            // FCF[13:12] (the frame version 
                                            // subfield) is higher than 
                                            // MAX_FRAME_VERSION[1:0] and frame 
                                            // filtering is enabled, the frame 
                                            // is rejected. 

#define RFCORE_XREG_FRMFILT0_MAX_FRAME_VERSION_S 2
#define RFCORE_XREG_FRMFILT0_PAN_COORDINATOR \
                                0x00000002  // Should be set high when the 
                                            // device is a PAN coordinator, to 
                                            // accept frames with no 
                                            // destination address (as 
                                            // specified in Section 7.5.6.2 in 
                                            // IEEE 802.15.4) 0: Device is not 
                                            // a PAN coordinator 1: Device is a 
                                            // PAN coordinator 

#define RFCORE_XREG_FRMFILT0_PAN_COORDINATOR_M \
                                0x00000002
#define RFCORE_XREG_FRMFILT0_PAN_COORDINATOR_S 1
#define RFCORE_XREG_FRMFILT0_FRAME_FILTER_EN \
                                0x00000001  // Enables frame filtering When 
                                            // this bit is set, the radio 
                                            // performs frame filtering as 
                                            // specified in section 7.5.6.2 of 
                                            // IEEE 802.15.4(b), third 
                                            // filtering level. FRMFILT0[6:1] 
                                            // and FRMFILT1[7:1], together with 
                                            // the local address information, 
                                            // define the behavior of the 
                                            // filtering algorithm. 0: Frame 
                                            // filtering off. (FRMFILT0[6:1], 
                                            // FRMFILT1[7:1] and SRCMATCH[2:0] 
                                            // are don't care.) 1: Frame 
                                            // filtering on. 

#define RFCORE_XREG_FRMFILT0_FRAME_FILTER_EN_M \
                                0x00000001
#define RFCORE_XREG_FRMFILT0_FRAME_FILTER_EN_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_FRMFILT1 register.
//
//*****************************************************************************
#define RFCORE_XREG_FRMFILT1_ACCEPT_FT_3_MAC_CMD \
                                0x00000040  // Defines whether MAC command 
                                            // frames are accepted or not. MAC 
                                            // command frames have frame type = 
                                            // 011. 0: Reject 1: Accept 

#define RFCORE_XREG_FRMFILT1_ACCEPT_FT_3_MAC_CMD_M \
                                0x00000040
#define RFCORE_XREG_FRMFILT1_ACCEPT_FT_3_MAC_CMD_S 6
#define RFCORE_XREG_FRMFILT1_ACCEPT_FT_2_ACK \
                                0x00000020  // Defines whether acknowledgment 
                                            // frames are accepted or not. 
                                            // Acknowledgement frames have 
                                            // frame type = 010. 0: Reject 1: 
                                            // Accept 

#define RFCORE_XREG_FRMFILT1_ACCEPT_FT_2_ACK_M \
                                0x00000020
#define RFCORE_XREG_FRMFILT1_ACCEPT_FT_2_ACK_S 5
#define RFCORE_XREG_FRMFILT1_ACCEPT_FT_1_DATA \
                                0x00000010  // Defines whether data frames are 
                                            // accepted or not. Data frames 
                                            // have frame type = 001. 0: Reject 
                                            // 1: Accept 

#define RFCORE_XREG_FRMFILT1_ACCEPT_FT_1_DATA_M \
                                0x00000010
#define RFCORE_XREG_FRMFILT1_ACCEPT_FT_1_DATA_S 4
#define RFCORE_XREG_FRMFILT1_ACCEPT_FT_0_BEACON \
                                0x00000008  // Defines whether beacon frames 
                                            // are accepted or not. Beacon 
                                            // frames have frame type = 000. 0: 
                                            // Reject 1: Accept 

