renfernand/OWSNRIT/openwsn/bsp/boards/cc2538em/inc/hw_rfcore_xreg.h
#define RFCORE_XREG_FREQCTRL_FREQ_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_TXPOWER register.
//
//*****************************************************************************
#define RFCORE_XREG_TXPOWER_PA_POWER_M \
                                0x000000F0  // PA power control 

#define RFCORE_XREG_TXPOWER_PA_POWER_S 4
#define RFCORE_XREG_TXPOWER_PA_BIAS_M \
                                0x0000000F  // PA bias control 

#define RFCORE_XREG_TXPOWER_PA_BIAS_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_TXCTRL register.
//
//*****************************************************************************
#define RFCORE_XREG_TXCTRL_DAC_CURR_M \
                                0x00000070  // Change the current in the DAC. 

#define RFCORE_XREG_TXCTRL_DAC_CURR_S 4
#define RFCORE_XREG_TXCTRL_DAC_DC_M \
                                0x0000000C  // Adjusts the DC level to the TX 
                                            // mixer. 

#define RFCORE_XREG_TXCTRL_DAC_DC_S 2
#define RFCORE_XREG_TXCTRL_TXMIX_CURRENT_M \
                                0x00000003  // Transmit mixers core current 
                                            // Current increases with 
                                            // increasing setting. 

#define RFCORE_XREG_TXCTRL_TXMIX_CURRENT_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_FSMSTAT0 register.
//
//*****************************************************************************
#define RFCORE_XREG_FSMSTAT0_CAL_DONE \
                                0x00000080  // Frequency synthesis calibration 
                                            // has been performed since the 
                                            // last time the FS was turned on. 

#define RFCORE_XREG_FSMSTAT0_CAL_DONE_M \
                                0x00000080
#define RFCORE_XREG_FSMSTAT0_CAL_DONE_S 7
#define RFCORE_XREG_FSMSTAT0_CAL_RUNNING \
                                0x00000040  // Frequency synthesis calibration 
                                            // status 0: Calibration is 
                                            // complete or not started. 1: 
                                            // Calibration is in progress. 

#define RFCORE_XREG_FSMSTAT0_CAL_RUNNING_M \
                                0x00000040
#define RFCORE_XREG_FSMSTAT0_CAL_RUNNING_S 6
#define RFCORE_XREG_FSMSTAT0_FSM_FFCTRL_STATE_M \
                                0x0000003F  // Gives the current state of the 
                                            // FIFO and frame control (FFCTRL) 
                                            // finite state-machine. 

#define RFCORE_XREG_FSMSTAT0_FSM_FFCTRL_STATE_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_FSMSTAT1 register.
//
//*****************************************************************************
#define RFCORE_XREG_FSMSTAT1_FIFO \
                                0x00000080  // FIFO is high when there is data 
                                            // in the RX FIFO. FIFO is low 
                                            // during RX FIFO overflow. 

#define RFCORE_XREG_FSMSTAT1_FIFO_M \
                                0x00000080
#define RFCORE_XREG_FSMSTAT1_FIFO_S 7
#define RFCORE_XREG_FSMSTAT1_FIFOP \
                                0x00000040  // FIFOP is set high when there 
                                            // are at more than FIFOP_THR bytes 
                                            // of data in the RX FIFO that has 
                                            // passed frame filtering. FIFOP is 
                                            // set high when there is at least 
                                            // one complete frame in the RX 
                                            // FIFO. FIFOP is high during RX 
                                            // FIFO overflow. 

#define RFCORE_XREG_FSMSTAT1_FIFOP_M \
                                0x00000040
#define RFCORE_XREG_FSMSTAT1_FIFOP_S 6
#define RFCORE_XREG_FSMSTAT1_SFD \
                                0x00000020  // In TX 0: When a complete frame 
                                            // with SFD was sent or no SFD was 
                                            // sent 1: SFD was sent. In RX 0: 
                                            // When a complete frame was 
                                            // received or no SFD was received 
                                            // 1: SFD was received. 

#define RFCORE_XREG_FSMSTAT1_SFD_M \
                                0x00000020
#define RFCORE_XREG_FSMSTAT1_SFD_S 5
#define RFCORE_XREG_FSMSTAT1_CCA \
                                0x00000010  // Clear channel assessment 
                                            // Dependent on CCA_MODE settings. 
                                            // See CCACTRL1 for details. 

#define RFCORE_XREG_FSMSTAT1_CCA_M \
                                0x00000010
#define RFCORE_XREG_FSMSTAT1_CCA_S 4
#define RFCORE_XREG_FSMSTAT1_SAMPLED_CCA \
                                0x00000008  // Contains a sampled value of the 
                                            // CCA The value is updated when a 
                                            // SSAMPLECCA or STXONCCA strobe is 
                                            // issued. 

#define RFCORE_XREG_FSMSTAT1_SAMPLED_CCA_M \
                                0x00000008
#define RFCORE_XREG_FSMSTAT1_SAMPLED_CCA_S 3
#define RFCORE_XREG_FSMSTAT1_LOCK_STATUS \
                                0x00000004  // 1 when PLL is in lock; 
                                            // otherwise 0 

