renfernand/OWSNRIT/openwsn/bsp/boards/cc2538em/inc/hw_rfcore_xreg.h
#define RFCORE_XREG_FSMSTAT1_LOCK_STATUS_M \
                                0x00000004
#define RFCORE_XREG_FSMSTAT1_LOCK_STATUS_S 2
#define RFCORE_XREG_FSMSTAT1_TX_ACTIVE \
                                0x00000002  // Status signal Active when FFC 
                                            // is in one of the transmit states 

#define RFCORE_XREG_FSMSTAT1_TX_ACTIVE_M \
                                0x00000002
#define RFCORE_XREG_FSMSTAT1_TX_ACTIVE_S 1
#define RFCORE_XREG_FSMSTAT1_RX_ACTIVE \
                                0x00000001  // Status signal Active when FFC 
                                            // is in one of the receive states 

#define RFCORE_XREG_FSMSTAT1_RX_ACTIVE_M \
                                0x00000001
#define RFCORE_XREG_FSMSTAT1_RX_ACTIVE_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_FIFOPCTRL register.
//
//*****************************************************************************
#define RFCORE_XREG_FIFOPCTRL_FIFOP_THR_M \
                                0x0000007F  // Threshold used when generating 
                                            // FIFOP signal 

#define RFCORE_XREG_FIFOPCTRL_FIFOP_THR_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_FSMCTRL register.
//
//*****************************************************************************
#define RFCORE_XREG_FSMCTRL_SLOTTED_ACK \
                                0x00000002  // Controls timing of transmission 
                                            // of acknowledge frames 0: The 
                                            // acknowledge frame is sent 12 
                                            // symbol periods after the end of 
                                            // the received frame which 
                                            // requests the aknowledge. 1: The 
                                            // acknowledge frame is sent at the 
                                            // first backoff-slot boundary more 
                                            // than 12 symbol periods after the 
                                            // end of the received frame which 
                                            // requests the aknowledge. 

#define RFCORE_XREG_FSMCTRL_SLOTTED_ACK_M \
                                0x00000002
#define RFCORE_XREG_FSMCTRL_SLOTTED_ACK_S 1
#define RFCORE_XREG_FSMCTRL_RX2RX_TIME_OFF \
                                0x00000001  // Defines whether or not a 
                                            // 12-symbol time-out should be 
                                            // used after frame reception has 
                                            // ended. 0: No time-out 1: 
                                            // 12-symbol-period time-out 

#define RFCORE_XREG_FSMCTRL_RX2RX_TIME_OFF_M \
                                0x00000001
#define RFCORE_XREG_FSMCTRL_RX2RX_TIME_OFF_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_CCACTRL0 register.
//
//*****************************************************************************
#define RFCORE_XREG_CCACTRL0_CCA_THR_M \
                                0x000000FF  // Clear-channel-assessment 
                                            // threshold value, signed 
                                            // 2's-complement number for 
                                            // comparison with the RSSI. The 
                                            // unit is 1 dB, offset is 73dB The 
                                            // CCA signal goes high when the 
                                            // received signal is below this 
                                            // value. The CCA signal is 
                                            // available on the CCA pin and in 
                                            // the FSMSTAT1 register. The value 
                                            // must never be set lower than 
                                            // CCA_HYST - 128 to avoid 
                                            // erroneous behavior of the CCA 
                                            // signal. Note: The reset value 
                                            // translates to an input level of 
                                            // approximately -32 - 73 = -105 
                                            // dBm, which is well below the 
                                            // sensitivity limit. This means 
                                            // that the CCA signal never 
                                            // indicates a clear channel. This 
                                            // register should be updated to 
                                            // 0xF8, which translates to an 
                                            // input level of about -8 - 73 = 
                                            // -81 dBm. 

#define RFCORE_XREG_CCACTRL0_CCA_THR_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_CCACTRL1 register.
//
//*****************************************************************************
#define RFCORE_XREG_CCACTRL1_CCA_MODE_M \
                                0x00000018  // 00: CCA always set to 1 01: CCA 
                                            // = 1 when RSSI < CCA_THR - 
                                            // CCA_HYST; CCA = 0 when RSSI >= 
                                            // CCA_THR 10: CCA = 1 when not 
                                            // receiving a frame, else CCA = 0 
                                            // 11: CCA = 1 when RSSI < CCA_THR 
                                            // - CCA_HYST and not receiving a 
                                            // frame; CCA = 0 when RSSI >= 
                                            // CCA_THR or when receiving a 
                                            // frame 

#define RFCORE_XREG_CCACTRL1_CCA_MODE_S 3
#define RFCORE_XREG_CCACTRL1_CCA_HYST_M \
                                0x00000007  // Sets the level of CCA 
                                            // hysteresis. Unsigned values 
                                            // given in dB 

#define RFCORE_XREG_CCACTRL1_CCA_HYST_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_RSSI register.
//
//*****************************************************************************
#define RFCORE_XREG_RSSI_RSSI_VAL_M \
                                0x000000FF  // RSSI estimate on a logarithmic 
                                            // scale, signed number on 2's 
                                            // complement Unit is 1 dB, offset 
                                            // is 73dB. The RSSI value is 
                                            // averaged over eight symbol 
                                            // periods. The RSSI_VALID status 
                                            // bit should be checked before 
                                            // reading RSSI_VAL for the first 
                                            // time. The reset value of -128 
                                            // also indicates that the RSSI 
                                            // value is invalid. 

#define RFCORE_XREG_RSSI_RSSI_VAL_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_RSSISTAT register.
//
//*****************************************************************************
#define RFCORE_XREG_RSSISTAT_RSSI_VALID \
                                0x00000001  // RSSI value is valid. Occurs 
                                            // eight symbol periods after 
                                            // entering RX. 

#define RFCORE_XREG_RSSISTAT_RSSI_VALID_M \
                                0x00000001
#define RFCORE_XREG_RSSISTAT_RSSI_VALID_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_RXFIRST register.
//
//*****************************************************************************
#define RFCORE_XREG_RXFIRST_DATA_M \
                                0x000000FF  // First byte of the RX FIFO Note: 
                                            // Reading this register does not 
                                            // modify the contents of the FIFO. 

