renfernand/OWSNRIT/openwsn/bsp/boards/cc2538em/inc/hw_rfcore_xreg.h
#define RFCORE_XREG_FREQEST_FREQEST_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_RXCTRL register.
//
//*****************************************************************************
#define RFCORE_XREG_RXCTRL_GBIAS_LNA2_REF_M \
                                0x00000030  // Adjusts front-end LNA2/mixer 
                                            // PTAT current output (from M = 3 
                                            // to M = 6), default: M = 5 

#define RFCORE_XREG_RXCTRL_GBIAS_LNA2_REF_S 4
#define RFCORE_XREG_RXCTRL_GBIAS_LNA_REF_M \
                                0x0000000C  // Adjusts front-end LNA PTAT 
                                            // current output (from M = 3 to M 
                                            // = 6), default: M = 5 

#define RFCORE_XREG_RXCTRL_GBIAS_LNA_REF_S 2
#define RFCORE_XREG_RXCTRL_MIX_CURRENT_M \
                                0x00000003  // Control of the output current 
                                            // from the receiver mixers The 
                                            // current increases with 
                                            // increasing setting set. 

#define RFCORE_XREG_RXCTRL_MIX_CURRENT_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_FSCTRL register.
//
//*****************************************************************************
#define RFCORE_XREG_FSCTRL_PRE_CURRENT_M \
                                0x000000C0  // Prescaler current setting 

#define RFCORE_XREG_FSCTRL_PRE_CURRENT_S 6
#define RFCORE_XREG_FSCTRL_LODIV_BUF_CURRENT_TX_M \
                                0x00000030  // Adjusts current in mixer and PA 
                                            // buffers Used when TX_ACTIVE = 1 

#define RFCORE_XREG_FSCTRL_LODIV_BUF_CURRENT_TX_S 4
#define RFCORE_XREG_FSCTRL_LODIV_BUF_CURRENT_RX_M \
                                0x0000000C  // Adjusts current in mixer and PA 
                                            // buffers Used when TX_ACTIVE = 0 

#define RFCORE_XREG_FSCTRL_LODIV_BUF_CURRENT_RX_S 2
#define RFCORE_XREG_FSCTRL_LODIV_CURRENT_M \
                                0x00000003  // Adjusts divider currents, 
                                            // except mixer and PA buffers 

#define RFCORE_XREG_FSCTRL_LODIV_CURRENT_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_FSCAL0 register.
//
//*****************************************************************************
#define RFCORE_XREG_FSCAL0_VCO_CURR_COMP_EN_OV \
                                0x00000080  // Force on the current comparator 
                                            // in the VCO. This signal is ORed 
                                            // with the signal coming from the 
                                            // calibration module. 

#define RFCORE_XREG_FSCAL0_VCO_CURR_COMP_EN_OV_M \
                                0x00000080
#define RFCORE_XREG_FSCAL0_VCO_CURR_COMP_EN_OV_S 7
#define RFCORE_XREG_FSCAL0_CHP_DISABLE \
                                0x00000040  // Set this bit to manually 
                                            // disable charge pump by masking 
                                            // the up and down pulses from the 
                                            // phase detector. 

#define RFCORE_XREG_FSCAL0_CHP_DISABLE_M \
                                0x00000040
#define RFCORE_XREG_FSCAL0_CHP_DISABLE_S 6
#define RFCORE_XREG_FSCAL0_CHP_CURRENT_M \
                                0x0000003C  // Digital bit vector defining the 
                                            // charge-pump output current on an 
                                            // exponential scale If 
                                            // FFC_BW_BOOST = 0, the read value 
                                            // is the value stored in 
                                            // CHP_CURRENT. If FFC_BW_BOOST = 
                                            // 1, the read value is CHP_CURRENT 
                                            // + 4. If the addition causes 
                                            // overflow, the signal is 
                                            // saturated. 

#define RFCORE_XREG_FSCAL0_CHP_CURRENT_S 2
#define RFCORE_XREG_FSCAL0_BW_BOOST_MODE_M \
                                0x00000003  // Control signal Defines the 
                                            // synthesizer boost mode 00: No 
                                            // BW_BOOST 01: BW_BOOST is high 
                                            // during calibration and 
                                            // approximately 30 us into the 
                                            // settling. 10: BW_BOOST is always 
                                            // on (or high). 11: Reserved 

#define RFCORE_XREG_FSCAL0_BW_BOOST_MODE_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_FSCAL1 register.
//
//*****************************************************************************
#define RFCORE_XREG_FSCAL1_VCO_CURR_CAL_OE \
                                0x00000080  // Override current calibration 

#define RFCORE_XREG_FSCAL1_VCO_CURR_CAL_OE_M \
                                0x00000080
#define RFCORE_XREG_FSCAL1_VCO_CURR_CAL_OE_S 7
#define RFCORE_XREG_FSCAL1_VCO_CURR_CAL_M \
                                0x0000007C  // Calibration result Override 
                                            // value if VCO_CURR_CAL_OE = 1 

#define RFCORE_XREG_FSCAL1_VCO_CURR_CAL_S 2
#define RFCORE_XREG_FSCAL1_VCO_CURR_M \
                                0x00000003  // Defines current in VCO core 
                                            // Sets the multiplier between 
                                            // calibrated current and VCO 
                                            // current. 

#define RFCORE_XREG_FSCAL1_VCO_CURR_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_FSCAL2 register.
//
//*****************************************************************************
#define RFCORE_XREG_FSCAL2_VCO_CAPARR_OE \
                                0x00000040  // Override the calibration result 
                                            // with the value from 
                                            // VCO_CAPARR[5:0]. 

