renfernand/OWSNRIT/openwsn/bsp/boards/cc2538em/inc/hw_rfcore_xreg.h
#define RFCORE_XREG_ADCTEST0_ADC_VREF_ADJ_S 6
#define RFCORE_XREG_ADCTEST0_ADC_QUANT_ADJ_M \
                                0x00000030  // Quantizer threshold control for 
                                            // test and debug 

#define RFCORE_XREG_ADCTEST0_ADC_QUANT_ADJ_S 4
#define RFCORE_XREG_ADCTEST0_ADC_GM_ADJ_M \
                                0x0000000E  // Gm-control for test and debug 

#define RFCORE_XREG_ADCTEST0_ADC_GM_ADJ_S 1
#define RFCORE_XREG_ADCTEST0_ADC_DAC2_EN \
                                0x00000001  // Enables DAC2 for enhanced ADC 
                                            // stability 

#define RFCORE_XREG_ADCTEST0_ADC_DAC2_EN_M \
                                0x00000001
#define RFCORE_XREG_ADCTEST0_ADC_DAC2_EN_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_ADCTEST1 register.
//
//*****************************************************************************
#define RFCORE_XREG_ADCTEST1_ADC_TEST_CTRL_M \
                                0x000000F0  // ADC test mode selector 

#define RFCORE_XREG_ADCTEST1_ADC_TEST_CTRL_S 4
#define RFCORE_XREG_ADCTEST1_ADC_C2_ADJ_M \
                                0x0000000C  // Used to adjust capacitor values 
                                            // in ADC 

#define RFCORE_XREG_ADCTEST1_ADC_C2_ADJ_S 2
#define RFCORE_XREG_ADCTEST1_ADC_C3_ADJ_M \
                                0x00000003  // Used to adjust capacitor values 
                                            // in ADC 

#define RFCORE_XREG_ADCTEST1_ADC_C3_ADJ_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_ADCTEST2 register.
//
//*****************************************************************************
#define RFCORE_XREG_ADCTEST2_ADC_TEST_MODE_M \
                                0x00000060  // Test mode to enable output of 
                                            // ADC data from demodulator. When 
                                            // enabled, raw ADC data is clocked 
                                            // out on the GPIO pins. 00: Test 
                                            // mode disabled 01: Data from the 
                                            // I and Q ADCs are output (data 
                                            // rate 76 MHz) 10: Data from the I 
                                            // ADC is output. Two and two ADC 
                                            // samples grouped (data rate 38 
                                            // MHz) 11: Data from the Q ADC is 
                                            // output. Two and two ADC samples 
                                            // grouped (data rate 38 MHz) 

#define RFCORE_XREG_ADCTEST2_ADC_TEST_MODE_S 5
#define RFCORE_XREG_ADCTEST2_AAF_RS_M \
                                0x00000018  // Controls series resistance of 
                                            // AAF 

#define RFCORE_XREG_ADCTEST2_AAF_RS_S 3
#define RFCORE_XREG_ADCTEST2_ADC_FF_ADJ_M \
                                0x00000006  // Adjust feed forward 

#define RFCORE_XREG_ADCTEST2_ADC_FF_ADJ_S 1
#define RFCORE_XREG_ADCTEST2_ADC_DAC_ROT \
                                0x00000001  // Control of DAC DWA scheme 0 = 
                                            // DWA (scrambling) disabled 1 = 
                                            // DWA enabled 

#define RFCORE_XREG_ADCTEST2_ADC_DAC_ROT_M \
                                0x00000001
#define RFCORE_XREG_ADCTEST2_ADC_DAC_ROT_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_MDMTEST0 register.
//
//*****************************************************************************
#define RFCORE_XREG_MDMTEST0_TX_TONE_M \
                                0x000000F0  // Enables the possibility to 
                                            // transmit a baseband tone by 
                                            // picking samples from the sine 
                                            // tables with a controllable phase 
                                            // step between the samples. The 
                                            // step size is controlled by 
                                            // TX_TONE. If MDMTEST1.MOD_IF is 
                                            // 0, the tone is superpositioned 
                                            // on the modulated data, 
                                            // effectively giving modulation 
                                            // with an IF. If MDMTEST1.MOD_IF 
                                            // is 1, only the tone is 
                                            // transmitted. 0000: -6 MHz 0001: 
                                            // -4 MHz 0010: -3 MHz 0011: -2 MHz 
                                            // 0100: -1 MHz 0101: -500 kHz 
                                            // 0110: -4 kHz 0111: 0 1000: 4 kHz 
                                            // 1001: 500 kHz 1010: 1 MHz 1011: 
                                            // 2 MHz 1100: 3 MHz 1101: 4 MHz 
                                            // 1110: 6 MHz Others: Reserved 

#define RFCORE_XREG_MDMTEST0_TX_TONE_S 4
#define RFCORE_XREG_MDMTEST0_DC_WIN_SIZE_M \
                                0x0000000C  // Controls the numbers of samples 
                                            // to be accumulated between each 
                                            // dump of the accumulate-and-dump 
                                            // filter used in DC removal 00: 32 
                                            // samples 01: 64 samples 10: 128 
                                            // samples 11: 256 samples 

#define RFCORE_XREG_MDMTEST0_DC_WIN_SIZE_S 2
#define RFCORE_XREG_MDMTEST0_DC_BLOCK_MODE_M \
                                0x00000003  // Selects the mode of operation 
                                            // 00: The input signal to the DC 
                                            // blocker is passed to the output 
                                            // without any attempt to remove 
                                            // DC. 01: Enable DC cancellation. 
                                            // Normal operation 10: Freeze 
                                            // estimates of DC when sync is 
                                            // found. Resume estimating DC when 
                                            // searching for the next frame. 
                                            // 11: Reserved 

#define RFCORE_XREG_MDMTEST0_DC_BLOCK_MODE_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_MDMTEST1 register.
//
//*****************************************************************************
#define RFCORE_XREG_MDMTEST1_USEMIRROR_IF \
                                0x00000020  // 0: Use the normal IF frequency 
                                            // (MDMTEST0.TX_TONE) for automatic 
                                            // IF compensation of channel 
                                            // frequency on TX. 1: Use mirror 
                                            // IF frequency for automatic 
                                            // compensation of channel 
                                            // frequency on TX. 

