renfernand/OWSNRIT/openwsn/bsp/boards/cc2538em/inc/hw_rfcore_xreg.h
#define RFCORE_XREG_MDMTEST1_USEMIRROR_IF_M \
                                0x00000020
#define RFCORE_XREG_MDMTEST1_USEMIRROR_IF_S 5
#define RFCORE_XREG_MDMTEST1_MOD_IF \
                                0x00000010  // 0: Modulation is performed at 
                                            // an IF set by MDMTEST0.TX_TONE. 
                                            // The tone set by MDMTEST0.TX_TONE 
                                            // is superimposed on the data. 1: 
                                            // Modulate a tone set by 
                                            // MDMTEST0.TX_TONE. A tone is 
                                            // transmitted with frequency set 
                                            // by MDMTEST0.TX_TONE. 

#define RFCORE_XREG_MDMTEST1_MOD_IF_M \
                                0x00000010
#define RFCORE_XREG_MDMTEST1_MOD_IF_S 4
#define RFCORE_XREG_MDMTEST1_RAMP_AMP \
                                0x00000008  // 1: Enable ramping of DAC output 
                                            // amplitude during startup and 
                                            // finish. 0: Disable ramping of 
                                            // DAC output amplitude. 

#define RFCORE_XREG_MDMTEST1_RAMP_AMP_M \
                                0x00000008
#define RFCORE_XREG_MDMTEST1_RAMP_AMP_S 3
#define RFCORE_XREG_MDMTEST1_RFC_SNIFF_EN \
                                0x00000004  // 0: Packet sniffer module 
                                            // disabled 1: Packet sniffer 
                                            // module enabled. The received and 
                                            // transmitted data can be observed 
                                            // on GPIO pins. 

#define RFCORE_XREG_MDMTEST1_RFC_SNIFF_EN_M \
                                0x00000004
#define RFCORE_XREG_MDMTEST1_RFC_SNIFF_EN_S 2
#define RFCORE_XREG_MDMTEST1_LOOPBACK_EN \
                                0x00000001  // Enables loopback of modulated 
                                            // data into the receiver chain 0: 
                                            // An STXCAL instruction calibrates 
                                            // for TX. Use STXON to continue to 
                                            // active TX. 1: An STXCAL 
                                            // instruction enables the loopback 
                                            // mode. 

#define RFCORE_XREG_MDMTEST1_LOOPBACK_EN_M \
                                0x00000001
#define RFCORE_XREG_MDMTEST1_LOOPBACK_EN_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_DACTEST0 register.
//
//*****************************************************************************
#define RFCORE_XREG_DACTEST0_DAC_Q_M \
                                0x400886FF  // Q-branch DAC override value 
                                            // when DAC_SRC = 001 If DAC_SRC is 
                                            // set to be ADC data, CORDIC 
                                            // magnitude, or channel filtered 
                                            // data, then DAC_Q_O controls the 
                                            // part of the word in question 
                                            // that is actually multiplexed to 
                                            // the DAC, as described below. 
                                            // 000111: Bits 7:0 001000: Bits 
                                            // 8:1 001001: Bits 9:2 ... If an 
                                            // invalid setting is chosen, the 
                                            // DAC outputs only zeros (minimum 
                                            // value). 

#define RFCORE_XREG_DACTEST0_DAC_Q_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_DACTEST1 register.
//
//*****************************************************************************
#define RFCORE_XREG_DACTEST1_DAC_I_M \
                                0x400886FF  // I-branch DAC override value 
                                            // when DAC_SRC = 001 If DAC_SRC is 
                                            // set to be ADC data, CORDIC 
                                            // magnitude, channel filtered 
                                            // data, or DC filtered data, then 
                                            // DAC_I_O controls the part of the 
                                            // word in question that is 
                                            // actually multiplexed to the DAC 
                                            // as described below. 000111: Bits 
                                            // 7:0 001000: Bits 8:1 001001: 
                                            // Bits 9:2 ... If an invalid 
                                            // setting is chosen, then the DAC 
                                            // outputs only zeros (minimum 
                                            // value). 

#define RFCORE_XREG_DACTEST1_DAC_I_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_DACTEST2 register.
//
//*****************************************************************************
#define RFCORE_XREG_DACTEST2_DAC_DEM_EN \
                                0x00000020  // Enable and disable dynamic 
                                            // element matching Drives 
                                            // RFR_DAC_DEM_EN 

#define RFCORE_XREG_DACTEST2_DAC_DEM_EN_M \
                                0x00000020
#define RFCORE_XREG_DACTEST2_DAC_DEM_EN_S 5
#define RFCORE_XREG_DACTEST2_DAC_CASC_CTRL_M \
                                0x00000018  // Adjustment of output stage 
                                            // Drives RFR_DAC_CASC_CTRL 

