renfernand/OWSNRIT/openwsn/bsp/boards/cc2538em/inc/hw_rfcore_xreg.h
#define RFCORE_XREG_DACTEST2_DAC_CASC_CTRL_S 3
#define RFCORE_XREG_DACTEST2_DAC_SRC_M \
                                0x00000007  // The TX DACs data source is 
                                            // selected by DAC_SRC according 
                                            // to: 000: Normal operation (from 
                                            // modulator) 001: The DAC_I_O and 
                                            // DAC_Q_O override values 010: ADC 
                                            // data after decimation, magnitude 
                                            // controlled by DAC_I_O and 
                                            // DAC_Q_O 011: I/Q after 
                                            // decimation, channel and DC 
                                            // filtering, magnitude controlled 
                                            // by DAC_I_O and DAC_Q_O 100: 
                                            // CORDIC magnitude output and 
                                            // front-end gain is output, 
                                            // magnitude controlled by DAC_I_O 
                                            // and DAC_Q_O 101: RSSI I output 
                                            // on the I DAC 111: Reserved 

#define RFCORE_XREG_DACTEST2_DAC_SRC_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_ATEST register.
//
//*****************************************************************************
#define RFCORE_XREG_ATEST_ATEST_CTRL_M \
                                0x0000003F  // Controls the analog test mode: 
                                            // 00 0000: Disabled 00 0001: 
                                            // Enables the temperature sensor 
                                            // (see also the CCTEST_TR0 
                                            // register description). Other 
                                            // values reserved. 

#define RFCORE_XREG_ATEST_ATEST_CTRL_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_PTEST0 register.
//
//*****************************************************************************
#define RFCORE_XREG_PTEST0_PRE_PD \
                                0x00000080  // Prescaler power-down signal 
                                            // When PD_OVERRIDE = 1 

#define RFCORE_XREG_PTEST0_PRE_PD_M \
                                0x00000080
#define RFCORE_XREG_PTEST0_PRE_PD_S 7
#define RFCORE_XREG_PTEST0_CHP_PD \
                                0x00000040  // Charge pump power-down signal 
                                            // When PD_OVERRIDE = 1 

#define RFCORE_XREG_PTEST0_CHP_PD_M \
                                0x00000040
#define RFCORE_XREG_PTEST0_CHP_PD_S 6
#define RFCORE_XREG_PTEST0_ADC_PD \
                                0x00000020  // ADC power-down signal When 
                                            // PD_OVERRIDE = 1 

#define RFCORE_XREG_PTEST0_ADC_PD_M \
                                0x00000020
#define RFCORE_XREG_PTEST0_ADC_PD_S 5
#define RFCORE_XREG_PTEST0_DAC_PD \
                                0x00000010  // DAC power-down signal When 
                                            // PD_OVERRIDE = 1 

#define RFCORE_XREG_PTEST0_DAC_PD_M \
                                0x00000010
#define RFCORE_XREG_PTEST0_DAC_PD_S 4
#define RFCORE_XREG_PTEST0_LNA_PD_M \
                                0x0000000C  // Low-noise amplifier power-down 
                                            // signal Defines LNA/mixer 
                                            // power-down modes: 00: Power up 
                                            // 01: LNA off, mixer/regulator on 
                                            // 10: LNA/mixer off, regulator on 
                                            // 11: PD When PD_OVERRIDE = 1 

#define RFCORE_XREG_PTEST0_LNA_PD_S 2
#define RFCORE_XREG_PTEST0_TXMIX_PD \
                                0x00000002  // Transmit mixer power-down 
                                            // signal When PD_OVERRIDE = 1 

#define RFCORE_XREG_PTEST0_TXMIX_PD_M \
                                0x00000002
#define RFCORE_XREG_PTEST0_TXMIX_PD_S 1
#define RFCORE_XREG_PTEST0_AAF_PD \
                                0x00000001  // Antialiasing filter power-down 
                                            // signal When PD_OVERRIDE = 1 

#define RFCORE_XREG_PTEST0_AAF_PD_M \
                                0x00000001
#define RFCORE_XREG_PTEST0_AAF_PD_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_PTEST1 register.
//
//*****************************************************************************
#define RFCORE_XREG_PTEST1_PD_OVERRIDE \
                                0x00000008  // Override enabling and disabling 
                                            // of various modules (for debug 
                                            // and testing only) It is 
                                            // impossible to override 
                                            // hard-coded BIAS_PD[1:0] 
                                            // depenancy. 

#define RFCORE_XREG_PTEST1_PD_OVERRIDE_M \
                                0x00000008
#define RFCORE_XREG_PTEST1_PD_OVERRIDE_S 3
#define RFCORE_XREG_PTEST1_PA_PD \
                                0x00000004  // Power amplifier power-down 
                                            // signal When PD_OVERRIDE = 1 

#define RFCORE_XREG_PTEST1_PA_PD_M \
                                0x00000004
#define RFCORE_XREG_PTEST1_PA_PD_S 2
#define RFCORE_XREG_PTEST1_VCO_PD \
                                0x00000002  // VCO power-down signal When 
                                            // PD_OVERRIDE = 1 

#define RFCORE_XREG_PTEST1_VCO_PD_M \
                                0x00000002
#define RFCORE_XREG_PTEST1_VCO_PD_S 1
#define RFCORE_XREG_PTEST1_LODIV_PD \
                                0x00000001  // LO power-down signal When 
                                            // PD_OVERRIDE = 1 

#define RFCORE_XREG_PTEST1_LODIV_PD_M \
                                0x00000001
#define RFCORE_XREG_PTEST1_LODIV_PD_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_CSPPROG0 register.
//
//*****************************************************************************
#define RFCORE_XREG_CSPPROG0_CSP_INSTR_M \
                                0x000000FF  // Byte N of the CSP program 
                                            // memory 

#define RFCORE_XREG_CSPPROG0_CSP_INSTR_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_CSPPROG1 register.
//
//*****************************************************************************
#define RFCORE_XREG_CSPPROG1_CSP_INSTR_M \
                                0x000000FF  // Byte N of the CSP program 
                                            // memory 

#define RFCORE_XREG_CSPPROG1_CSP_INSTR_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_XREG_CSPPROG2 register.
//
//*****************************************************************************
#define RFCORE_XREG_CSPPROG2_CSP_INSTR_M \
                                0x000000FF  // Byte N of the CSP program 
                                            // memory 

